---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarDeformationType.Deformed
enum: Autodesk.Revit.DB.Structure.RebarDeformationType
source: html/43f6921e-179f-ce9d-5209-f1182bf50d14.htm
---
# Autodesk.Revit.DB.Structure.RebarDeformationType.Deformed

The bar is ribbed.